vertical-pod-autoscaler/experiments/sn-pbr-throughput/0/compose.log
Running 15m test @ http://10.107.150.159:8080/wrk2-api/post/compose
  2 threads and 4 connections
  Thread calibration: mean lat.: 20.607ms, rate sampling interval: 51ms
  Thread calibration: mean lat.: 16.885ms, rate sampling interval: 37ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.13m    46.51s    2.60m    66.22%
    Req/Sec     4.52     10.63    54.00     82.76%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.23m 
 75.000%    1.47m 
 90.000%    2.44m 
 99.000%    2.60m 
 99.900%    2.67m 
 99.990%    2.68m 
 99.999%    2.68m 
100.000%    2.68m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       9.655     0.000000            1         1.00
    2732.031     0.100000          799         1.11
   30359.551     0.200000         1599         1.25
   36306.943     0.300000         2394         1.43
   41680.895     0.400000         3194         1.67
   73727.999     0.500000         3994         2.00
   76808.191     0.550000         4401         2.22
   78446.591     0.600000         4811         2.50
   80216.063     0.650000         5188         2.86
   82640.895     0.700000         5599         3.33
   88276.991     0.750000         5988         4.00
   92209.151     0.775000         6189         4.44
   97058.815     0.800000         6386         5.00
  127729.663     0.825000         6584         5.71
  142737.407     0.850000         6786         6.67
  144965.631     0.875000         6992         8.00
  145752.063     0.887500         7097         8.89
  146538.495     0.900000         7191        10.00
  147324.927     0.912500         7295        11.43
  147849.215     0.925000         7392        13.33
  148635.647     0.937500         7488        16.00
  149159.935     0.943750         7544        17.78
  149815.295     0.950000         7585        20.00
  150470.655     0.956250         7642        22.86
  150863.871     0.962500         7687        26.67
  151388.159     0.968750         7740        32.00
  151650.303     0.971875         7768        35.56
  151781.375     0.975000         7786        40.00
  152174.591     0.978125         7810        45.71
  152436.735     0.981250         7834        53.33
  152829.951     0.984375         7858        64.00
  153354.239     0.985938         7871        71.11
  154140.671     0.987500         7882        80.00
  154927.103     0.989062         7893        91.43
  156106.751     0.990625         7908       106.67
  156499.967     0.992188         7921       128.00
  156631.039     0.992969         7924       142.22
  156762.111     0.993750         7931       160.00
  157024.255     0.994531         7938       182.86
  157155.327     0.995313         7943       213.33
  157417.471     0.996094         7950       256.00
  157679.615     0.996484         7952       284.44
  158072.831     0.996875         7958       320.00
  158203.903     0.997266         7961       365.71
  158334.975     0.997656         7963       426.67
  158466.047     0.998047         7966       512.00
  158466.047     0.998242         7966       568.89
  158728.191     0.998437         7970       640.00
  158728.191     0.998633         7970       731.43
  158990.335     0.998828         7971       853.33
  160038.911     0.999023         7973      1024.00
  160038.911     0.999121         7973      1137.78
  160169.983     0.999219         7974      1280.00
  160301.055     0.999316         7975      1462.86
  160432.127     0.999414         7976      1706.67
  160563.199     0.999512         7978      2048.00
  160563.199     0.999561         7978      2275.56
  160563.199     0.999609         7978      2560.00
  160563.199     0.999658         7978      2925.71
  160563.199     0.999707         7978      3413.33
  160694.271     0.999756         7979      4096.00
  160694.271     0.999780         7979      4551.11
  160694.271     0.999805         7979      5120.00
  160694.271     0.999829         7979      5851.43
  160694.271     0.999854         7979      6826.67
  160956.415     0.999878         7980      8192.00
  160956.415     1.000000         7980          inf
#[Mean    =    67773.457, StdDeviation   =    46509.990]
#[Max     =   160825.344, Total count    =         7980]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  8097 requests in 15.00m, 1.66MB read
  Socket errors: connect 0, read 0, write 12, timeout 43
Requests/sec:      9.00
Transfer/sec:      1.89KB